package basic

import (
	"fmt"
	"testing"
)

func TestGoto(t *testing.T) {
	// fmt.Println("begin")
	//  i := 0
	// // 定义一个标签，这个标签只能被goto使用
	// lable:
	// if i < 5 {
	// 	fmt.Println("循环第", i, "次")
	// 	i++
	// 	// 调转到锚点RET处开始执行
	// 	goto lable
	// }
	// fmt.Println("end")
	
	// begin
	// 循环第 0 次
	// 循环第 1 次
	// 循环第 2 次
	// 循环第 3 次
	// 循环第 4 次
	// end
	// goto关键字，用来改变函数内代码的执行顺序，跳转到函数内指定的标签地方运行，goto不能跨函数代码块跳转
	// ----------------------------------------------------------------------------------------------------------------
	
	// 测试goto 关键字
	// x := 0
	// lable2:
	// 	for ;;x++ {
	// 		for i := 0; i < 10; i++ {
	// 			if x == 2 && i == 5 {
	// 				fmt.Printf("当前X: %v , 当前i: %v \n", x,i)
	// 				// 此种写法会导致死循环
	// 				goto lable2
	// 			}
	// 		}
	// 	}
	
	// ---------------------------------------------------------------------------------------------------------
	
	y := 0
	for ; ; y++ {
		for i := 0; i < 10; i++ {
			fmt.Printf(" >> 当前X: %v , 当前i: %v \n", y,i)
			if y == 5 && i ==5 {
				goto lable3
			}
		}
	}
lable3:
	fmt.Println("结束了 lable3 ")
	
}
